In [1]:
import pandas as pd
import sys

In [2]:
# Our small data set
d = {'one':[1,1,1,1,1],
     'two':[2,2,2,2,2],
     'letter':['a','a','b','b','c']}

df = pd.DataFrame(d)
df

   one  two letter
0    1    2      a
1    1    2      a
2    1    2      b
3    1    2      b
4    1    2      c

In [5]:
# Create group object
one = df.groupby('letter')
one.sum()

        one  two
letter
a         2    4
b         2    4
c         1    2

In [7]:
letterone = df.groupby(['letter','one']).sum()
letterone

            two
letter one
a      1      4
b      1      4
c      1      2

In [9]:
letterone.index

MultiIndex(levels=[['a', 'b', 'c'], [1]],
           labels=[[0, 1, 2], [0, 0, 0]],
           names=['letter', 'one'])

In [11]:
letterone = df.groupby(['letter','one'], as_index=False).sum()
letterone

  letter  one  two
0      a    1    4
1      b    1    4
2      c    1    2

In [12]:
letterone.index

Int64Index([0, 1, 2], dtype='int64')